<a href="https://colab.research.google.com/github/dhivyakarthik/data-science/blob/main/AdvPython_Pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
sales_data = pd.Series(
    [3000, 4500, 2000, 6500, 7000, 3000, 1500 ],
    index = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'],
    name = 'Daily_Sales')
sales_data

Mon    3000
Tue    4500
Wed    2000
Thu    6500
Fri    7000
Sat    3000
Sun    1500
Name: Daily_Sales, dtype: int64

In [ ]:
sales_data > 5000

Mon    False
Tue    False
Wed    False
Thu     True
Fri     True
Sat    False
Sun    False
Name: Daily_Sales, dtype: bool

In [ ]:
sales_data[sales_data > 5000]

Thu    6500
Fri    7000
Name: Daily_Sales, dtype: int64

In [ ]:
(sales_data > 5000) & (sales_data < 6800)

Mon    False
Tue    False
Wed    False
Thu     True
Fri    False
Sat    False
Sun    False
Name: Daily_Sales, dtype: bool

In [ ]:
sales_data[(sales_data > 5000) & (sales_data < 6800)]

Thu    6500
Name: Daily_Sales, dtype: int64

In [ ]:
average_sales = sales_data.mean()
average_sales
sales_data[sales_data < average_sales]

Mon    3000
Wed    2000
Sat    3000
Sun    1500
Name: Daily_Sales, dtype: int64

In [ ]:
sales_data.index.isin(['Sat', 'Sun'])

array([False, False, False, False, False,  True,  True])

In [ ]:
sales_data[sales_data.index.isin(['Sat', 'Sun'])]

Sat    3000
Sun    1500
Name: Daily_Sales, dtype: int64

In [ ]:
sales_data[(sales_data < 5000) & (~sales_data.index.isin(['Sat', 'Sun']))]

Mon    3000
Tue    4500
Wed    2000
Name: Daily_Sales, dtype: int64

In [ ]:
sales_data

Mon    3000
Tue    4500
Wed    2000
Thu    6500
Fri    7000
Sat    3000
Sun    1500
Name: Daily_Sales, dtype: int64

In [ ]:
sales_data.shift(1)

Mon       NaN
Tue    3000.0
Wed    4500.0
Thu    2000.0
Fri    6500.0
Sat    7000.0
Sun    3000.0
Name: Daily_Sales, dtype: float64

In [ ]:
sales_data.shift(-1)

Mon    4500.0
Tue    2000.0
Wed    6500.0
Thu    7000.0
Fri    3000.0
Sat    1500.0
Sun       NaN
Name: Daily_Sales, dtype: float64

In [ ]:
sales_data.diff()

Mon       NaN
Tue    1500.0
Wed   -2500.0
Thu    4500.0
Fri     500.0
Sat   -4000.0
Sun   -1500.0
Name: Daily_Sales, dtype: float64

In [ ]:
sales_data[(sales_data.shift(1) - sales_data) > 2000]

Wed    2000
Sat    3000
Name: Daily_Sales, dtype: int64

In [ ]:
#more operations on numpy and pandas

import numpy as np
import pandas as pd

In [ ]:
monthly_expenses_in_dollars = pd.Series(data = [700, 550, 480, 625, 670, 515], index = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'])
monthly_expenses_in_dollars

Jan    700
Feb    550
Mar    480
Apr    625
May    670
Jun    515
dtype: int64

In [ ]:
monthly_expenses_in_rupees = monthly_expenses_in_dollars.mul(88)
monthly_expenses_in_rupees

Jan    61600
Feb    48400
Mar    42240
Apr    55000
May    58960
Jun    45320
dtype: int64

In [ ]:
descend_rupees = monthly_expenses_in_rupees.sort_values(ascending = False)
descend_rupees

Jan    61600
May    58960
Apr    55000
Feb    48400
Jun    45320
Mar    42240
dtype: int64

In [ ]:
ans = monthly_expenses_in_dollars.mul(88).sort_values(ascending = False)
ans

Jan    61600
May    58960
Apr    55000
Feb    48400
Jun    45320
Mar    42240
dtype: int64

In [ ]:
my_series = pd.Series([10, 20, np.nan, 40, 50])
my_series

0    10.0
1    20.0
2     NaN
3    40.0
4    50.0
dtype: float64

In [ ]:
s1 = my_series.fillna(0)
s1

0    10.0
1    20.0
2     0.0
3    40.0
4    50.0
dtype: float64

In [ ]:
s2 = s1.loc[s1 > 10]
s2

1    20.0
3    40.0
4    50.0
dtype: float64

In [ ]:
s3 = s2.mul(3)
s3

1     60.0
3    120.0
4    150.0
dtype: float64

In [ ]:
s4 = s3.sort_values(ascending = False)
s4

4    150.0
3    120.0
1     60.0
dtype: float64

In [ ]:
s5 = s4.reset_index(drop = True)
s5

0    150.0
1    120.0
2     60.0
dtype: float64

In [ ]:
# All these steps can be achieved in a single line of code
my_series.fillna(0).loc[my_series > 10].mul(3).sort_values(ascending = False).reset_index(drop = True)

0    150.0
1    120.0
2     60.0
dtype: float64

In [ ]:
# Let's create a Series
data = [125, 113, 118, 124, 125, 120, 120, 118, 117, 118]
stocks = pd.Series(data = data, index = ['Day' + str(i) for i in range(len(data))], name = 'Closing stock price')
stocks

Day0    125
Day1    113
Day2    118
Day3    124
Day4    125
Day5    120
Day6    120
Day7    118
Day8    117
Day9    118
Name: Closing stock price, dtype: int64

In [ ]:
stocks.head()

Day0    125
Day1    113
Day2    118
Day3    124
Day4    125
Name: Closing stock price, dtype: int64

In [ ]:
stocks.head(n=3)

Day0    125
Day1    113
Day2    118
Name: Closing stock price, dtype: int64

In [ ]:
stocks.tail()

Day5    120
Day6    120
Day7    118
Day8    117
Day9    118
Name: Closing stock price, dtype: int64

In [ ]:
stocks.tail(n=3)

Day7    118
Day8    117
Day9    118
Name: Closing stock price, dtype: int64

In [ ]:
stocks.describe()

count     10.00000
mean     119.80000
std        3.88158
min      113.00000
25%      118.00000
50%      119.00000
75%      123.00000
max      125.00000
Name: Closing stock price, dtype: float64

In [ ]:
stocks.duplicated( )

Day0    False
Day1    False
Day2    False
Day3    False
Day4     True
Day5    False
Day6     True
Day7     True
Day8    False
Day9     True
Name: Closing stock price, dtype: bool

In [ ]:
stocks.drop_duplicates()
stocks.drop_duplicates(inplace = True)
stocks

Day0    125
Day1    113
Day2    118
Day3    124
Day5    120
Day8    117
Name: Closing stock price, dtype: int64

In [ ]:
series = pd.Series([10, 20, 30, 40, 50])
series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
series.apply(lambda x: x ** 2)

0     100
1     400
2     900
3    1600
4    2500
dtype: int64

In [ ]:
series.map(lambda x : x**2)

0     100
1     400
2     900
3    1600
4    2500
dtype: int64

In [ ]:
my_dict = {10: 'Hello', 30: 'World'}
series.map(my_dict)  # .map() can also be used to perform value replacements using a dictionary

0    Hello
1      NaN
2    World
3      NaN
4      NaN
dtype: object

In [ ]:
companies = pd.Series(['Meta', 'Ama!on', '#Apple', '#Netflix', 'Google', 'CORRUPT'])

In [ ]:
companies

0        Meta
1      Ama!on
2      #Apple
3    #Netflix
4      Google
5     CORRUPT
dtype: object

In [ ]:
companies.str.contains('!')

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [ ]:
dates = pd.Series(['2024-01-01', '2024-02-15', '2024-03-30'])
dates

0    2024-01-01
1    2024-02-15
2    2024-03-30
dtype: object

In [ ]:
dates.dtype
datetime_series = pd.to_datetime(dates)
datetime_series

0   2024-01-01
1   2024-02-15
2   2024-03-30
dtype: datetime64[ns]

In [ ]:
datetime_series.dt.year
datetime_series.dt.month
datetime_series.dt.day
datetime_series.dt.weekday
datetime_series.dt.day_name()

0      Monday
1    Thursday
2    Saturday
dtype: object

In [ ]:
datetime_series = datetime_series + pd.DateOffset(days = 7)
datetime_series

0   2024-01-08
1   2024-02-22
2   2024-04-06
dtype: datetime64[ns]

In [ ]:
new_datetime_series = datetime_series + pd.Timedelta(days = 10)  # shift every date 10 days ahead
new_datetime_series

0   2024-01-18
1   2024-03-03
2   2024-04-16
dtype: datetime64[ns]

In [ ]:
is_weekend = new_datetime_series.dt.weekday > 5  # find if the days are weekends
is_weekend

0    False
1     True
2    False
dtype: bool

In [ ]:
new_datetime_series.dt.day_name()

0    Thursday
1      Sunday
2     Tuesday
dtype: object